{
    "Name": "Shahanaz Shaik",
    "Primary Title": "Cloud Engineer",
    "Objective Summary": "Ops/Infrastructure engineer with 3+ years of hands-on experience in developing, automating and optimizing deployments over large infrastructure in AWS,  configuration management, CI/CD, and DevOps processes. Looking for a career opportunity where I can expand all my skill sets to the advantage of the organisation while having the scope to learn and develop new skills.",
    "Email": "azeesha280@gmail.com",
    "LinkedIn": "linkedin.com/in/shaik-shahanaz",
    "Telephone": "+44-7309645665",
    "Location": "Stoke-On-Trent, UK ",
    "Work Experience":[{
        "Company Name": "ASHTEK-IT-SOLUTIONS",
        "Client Name": "",
        "Role": "Associate Software Enginner",
        "Start Month Year": "2020/09 ",
        "End Month Year": "2021/05",
        "TaskAchievements": ["Responsible for design, develop, document, analyze, create, test and modify computer systems.",
        "Created code application pipelines using <b>Jenkins</b> and Infrastructure as Code pipelines using <b>AWS CodeBuild</b>.",
		"Enabled Continuous Delivery through Deployment into several environments of Test, QA, Stress and Production using Jenkins.",
        "Created <b>CloudFormation templates</b> for various AWS Cloud services like EC2, S3, EMR, ECS, RDS, Lambda,IAM, Secrets, KMS keys etc.,",
        "Worked on standardization of IAM user role policies of various personas like support, admin and development.",
        "Working on Cloud Economics Program which focuses on budgeting, cost analysis and savings on AWS Resources. "
        ],
        "Location": "London, UK",
        "Company Website": "https://www.ashtek.uk/"
    },
    {
        "Company Name": "YEPRA IT SERVICES PRIVATE LIMITED",
        "Client Name": "",
        "Role": "Software Trainee",
        "Start Month Year": "01/2018 ",
        "End Month Year": " 06/2019",
        "TaskAchievements": ["Responsible for data ingestion from various data sources (big data), data <b>cleansing</b> and data <b>wrangling</b>.",
        "Responsible for performing tasks like Branching, Tagging, and Release Activities on Version Control System GIT",
        "Utilized AWS CLI to automate backups of ephemeral data-stores to S3 buckets and EBS.",
        "Created <b>automated infrastructure deployment</b> in <b>AWS</b> using pipelines and <b>Ansible</b>, this includes from procurement of EC2 instance to installation, configuration, till consumption.",
        "Created topics in SNS to send notifications to subscribers as per the requirement."
		],
        "Location": "Hyderabad, India",
        "Company Website": "https://www.yepraservices.com/"
    }
    ],
    "Other Projects": [{
        "Title": "Automation Portal",
        "Sub Title": "ES Portal - A self-service portal for all admin, monitoring and automation activities for Informatica Service Line.",
        "Start Month Year": "03/2020",
        "End Month Year": "04/2021",
        "Location": "Hyderabad, India",
        "Description": "Acted as Technical Lead and Developer for development of ES Portal over the team of 4.",
        "Roles and Responsibilities": ["Development, design and Implementation of ES Portal for all the hosting and admin activities over the service line using technologies like <b>JS, Angular and PHP in AWS</b>.",
        "Integrated with Azure DevOps CI/CD for automated code deployments working in agile methodology by creating dynamic pipelines and <b>Azure Rest API</b>.",
        "Enabled auto-scaling, load balancer using AWS route53 along with the integration of Azure AD and Service-Now."
        ]
    }
    ],
    "Skills": {
        "Languages & Scripting": "Python, Core Java & Shell Scripting, Java Script",
        "Operating systems": "Linux and Windows",
        "SCM": "GIT, GITHUB",
        "Build Tools": "Maven",
        "Databases": "Oracle, MySQL",
        "CI/CD Orchestration": "Jenkins, Code Build & Code Pipeline",
        "Other Tools": "Sonar, Putty, WinScp, Sql Developer",
        "Container Tools": "Docker",
        "Utilities": "BMC Remedy, Service Now, Jira",
        "Cloud Services": "AWS, GCP",
        "Configuration Management": "Ansible, CloudFormation"
        },
    "Education":[
        {
        "Degree": "Master of Engineering",
        "Specialization": "Electrical, Electronic and Computer Engineering",
        "Website": "https://www.ntu.ac.uk/",
        "University": "Nottingham Trent University",
        "Start Month Year": "01/2020",
        "End Month Year": "02/2022",
        "Grade": "Distinction"
    }
    ],
    "Certifications": [
        "ISTQB Certified Tester, Foundation Level"
    ]
}