{
    "Name": "Shahanaz Shaik",
    "Primary Title": "",
    "Objective Summary": "Ops/Infrastructure engineer with 3+ years of hands-on experience in developing, automating and optimizing deployments over large infrastructure in AWS,  configuration management, CI/CD, and DevOps processes. Looking for a career opportunity where I can expand all my skill sets to the advantage of the organisation while having the scope to learn and develop new skills.",
    "Email": "shaik.shahanaz280@gmail.com",
    "LinkedIn": "linkedin.com/in/shaik-shahanaz-2036111a1",
    "Telephone": "+44-7309645665",
    "Location": "Stoke-On-Trent, UK ",
    "WebVersion": "",
	"Skills":[ {
        "Languages & Scripting": "Python, Core Java & Shell Scripting, Java Script",
        "Operating systems": "Linux and Windows",
        "SCM": "GIT, GITHUB",
        "Build Tools": "Maven",
        "Databases": "Oracle, MySQL",
        "CI/CD Orchestration": "Jenkins, Code Build & Code Pipeline",
        "Other Tools": "Sonar, Putty, WinScp, Sql Developer",
        "Container Tools": "Docker",
        "Utilities": "BMC Remedy, Service Now, Jira",
        "Cloud Services": "AWS, GCP",
        "Configuration Management": "Ansible, CloudFormation"
        }
	],
	"Work Experience":[{
        "Company Name": "ASHTEK-IT-SOLUTIONS",
        "Client Name": "GOC",
        "Role": "Associate Software Engineer",
        "Start Month Year": "2020/09 ",
        "End Month Year": "2022/05",
        "TaskAchievements": ["Responsible for design, develop, document, analyze, create, test and modify computer systems.",
        "Created code application pipelines using <b>Jenkins</b> and Infrastructure as Code pipelines using <b>AWS CodeBuild</b>.",
	"Enabled Continuous Delivery through Deployment into several environments of Test, QA, Stress and Production using Jenkins.",
        "Created <b>CloudFormation templates</b> for various AWS Cloud services like EC2, S3, ECS, RDS, Lambda,IAM, Secrets, KMS keys etc.,",
        "Worked on standardization of IAM user role policies of various personas like support, admin and development.",
        "Working on Cloud Economics Program which focuses on budgeting, cost analysis and savings on AWS Resources. ",
	"Configure logging and monitoring using AWS servies and implemented security monitoring and traffic."		     
        ],
        "Location": "UK",
        "Company Website": "https://www.ashtek.uk/"
    },
    {
        "Company Name": "Sarlak Techno Systems",
        "Client Name": "HTC",
        "Role": "Software Engineer",
        "Start Month Year": "04/2016 ",
        "End Month Year": " 09/2019",
        "TaskAchievements": ["Developed Cloud Formation scripts to build on demand EC2 instance formation.",
        "Responsible for performing tasks like Branching, Tagging, and Release Activities on Version Control System GIT",
        "Play a significant role in establishing operational processes for a fast-growing distributed cloud platform using AWS.",
	"Improve deployment process within AWS cross-region automated deployment.",
	"Used Nagios as monitoring tool and ELK for log management. ",
        "Created automated infrastructure deployment in AWS using pipelines and Ansible, this includes from procurement of EC2 instance to installation, configuration, till consumption.",
        "Analyze logs, traffic and alarms to detect anomalies or malicious activites.",
	"Created IAM roles and policies.",
	"Worked on logging and traffic monitoring of application with AWS services such as CloudTrail, Amazon CloudWatch and VPC Flow Logs.",	     
	"Responsible for taking the source code and compiling using Maven and package it in its distributable format, such as a JAR / WAR and deployed in Tomcat app server.",		     
	"Created S3 buckets in the AWS environment to store files, sometimes which are required to serve static content for a web application",
	"Created snapshots to take backups of the volumes and images to store launch configurations of the EC2 instances",
	"Created EBS volumes for storing application files for use with EC2 instances whenever they are mounted to them.",
	"Created and configured elastic load balancers and auto scaling groups to distribute the traffic and to have a cost efficient, fault tolerant and highly available environment.",
	"Used security groups, network ACL’s, internet gateways and route tables to ensure a secure zone for organization in AWS public cloud"		     
		],
        "Location": "India",
        "Company Website": "http://sarlaktechsys.com/"
    }
    ],
    "Other Projects": [{
        "Title": "ELECTRIC VEHICLE CHARGING MANAGEMENT – DRIVER RECOMMENDATION SYSTEM",
        "Sub Title": "Academic Research project",
        "Start Month Year": "",
        "End Month Year": "",
        "Location": "NTU, UK",
        "Description": "",
        "Roles and Responsibilities": ["This report project I had implemented an automatic real- time system where driver can easily locate the place to charge the vehicle on the move, to reduce the wait time near the charging slots, can be able to plan the trip in advance, can be able to detect the suitable CS from the vehicle in terms to time, distance and traffic congestion from google maps..",
        "Locate the position of vehicle in the google maps without any personalised subscriptions.",
        "Tested the working software functionalities of the developed system in both web and Android based applications"
	]			       
		 },
	{			       
	"Title": "CLOUD BASED SMART PARKING SYSTEM & DRIVER RECOMMENDATION SYSTEM FOR PARKING ",
        "Sub Title": "Major project",
        "Start Month Year": "",
        "End Month Year": "",
        "Location": "NTU, UK",
        "Description": "",
        "Roles and Responsibilities": ["Developed Recommendation system for driver to park the vehicle based on the price, distance, destination by developing a smart Internal parking system.",
        "Developed Automated gates by vehicle detection by scanning the number plate controlled by distance detecting sensors.",
	"Developed detection of the slot and alarm indication to driver to avoid collision to the wall, detection of pre- booked or already parked slots to reduce the human errors.",			       
        "Established the connection between all the parking areas management local repository and databases to central repositories of cloud server with the approaches of IoT wireless sensor networks WSN which can be managed by web-based applications."			       
	]			      
    }
    ],
    
    "Education":[
        {
        "Degree": "Master of Engineering",
        "Specialization": "Electrical, Electronic and Computer Engineering",
        "Website": "https://www.ntu.ac.uk/",
        "University": "Nottingham Trent University",
        "Start Month Year": "01/2020",
        "End Month Year": "02/2022",
        "Grade": "Distinction"
    }
    ],
    "Certifications": [
        "AWS Cloud Practioner Essentials",
	"ASTQB Foundation level certified "    
    ],
	"Interests": [
        "Artificial Intelligence",
        "Machine Learning",
        "Big Data",
        "Economics",
        "Android",
        "Marketing",
        "Physics"
    ]
}
